
"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def main():
    first(15)
    second(38)
    third(34)
def first(par1):
    print(par1)
def second(par2):
    print(par2)
def third(par3):
    print(par3)


main()
