
"""
Дана строка чисел от 0 до 9 необходимо создать словарь где в качестве ключа будет цифра,
а в качестве значения количество этих цифр в строке
"""
numbers = "0139412831055230677798"
dictionary={0:3, 1:3, 2:2, 3:3, 4:1, 5:2, 6:1, 7:3, 8:2, 9:2}
print(dictionary)

